// 1Task.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()

{
    for (int a = 2; a <= 17; a++)
    {
        int t = 3 * a;
        float z = 4.3 * t * t - 8 * t + 13;
        std::cout << "z = " << z << std::endl;
    }
    std::cout << "Enter the number k: ";
    int k;
    std::cin >> k;
    int* Mass = new int[k];
    for (int i = 0; i < k; i++) {
        Mass[i] = i + 1;
        std::cout << "Element " << i << " = " << Mass[i] << std::endl;
    }

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
